<?php

namespace App\Exports;

use App\Models\Servers;
use Maatwebsite\Excel\Concerns\FromCollection;
use Maatwebsite\Excel\Concerns\WithHeadings;

class ServresExport implements FromCollection, WithHeadings
{
    /**
     * @return \Illuminate\Support\Collection
     */
    public function collection()
    {
        return Servers::orderBy('id', 'DESC')->get([
            'name',
            'server_1',
            'name_1',
            'server_2',
            'name_2',
            'server_3',
            'name_3',
            'server_4',
            'name_4',
            'server_5',
            'name_5',
            'server_6',
            'name_6',
            'server_7',
            'name_7',
            'server_8',
            'name_8',
            'server_9',
            'name_9',
            'server_10',
            'name_10',
            'server_11',
            'name_11',
            'server_12',
            'name_12',
            'server_13',
            'name_13',
            'server_14',
            'name_14',
            'server_15',
            'name_15',
            'server_16',
            'name_16',
            'server_17',
            'name_17',
            'server_18',
            'name_18',
            'server_19',
            'name_19',
            'server_20',
            'name_20',
            'server_21',
            'name_21',
            'server_22',
            'name_22',
            'server_23',
            'name_23',
            'server_24',
            'name_24',
            'server_25',
            'name_25',
            'server_26',
            'name_26',
            'server_27',
            'name_27',
        ]);
    }


    public function headings(): array
    {
        return [
            'الإسم',
            'السؤال الأول',
            'الإجابة الأولى',
            'السؤال الثاني',
            'الإجابة الثانيه',
            'السؤال الثالث',
            'الإجابة الثالثه',
            'السؤال الرابع',
            'الإجابة الرابعه',
            'السؤال الخامس',
            'الإجابة الخامسه',
            'السؤال السادس',
            'الإجابة السادسه',
            'السؤال السابع',
            'الإجابة السابعه',
            'السؤال الثامن',
            'الإجابة الثامنه',
            'السؤال التاسع',
            'الإجابة التاسعه',
            'السؤال العاشر',
            'الإجابة العاشره',
            'السؤال الحادي عشر',
            'الإجابة الحاديه عشر',
            'السؤال الثاني عشر',
            'الإجابة الثانية عشر',
            'السؤال الثالث عشر',
            'الإجابة الثالثة عشر',
            'السؤال الرابع عشر',
            'الإجابة الرابعة عشر',
            'السؤال الخامس عشر',
            'الإجابة الخامسة عشر',
            'السؤال السادس عشر',
            'الإجابة السادسة عشر',
            'السؤال السابع عشر',
            'الإجابة السابعة عشر',
            'السؤال الثامن عشر',
            'الإجابة الثامنة عشر',
            'السؤال التاسع عشر',
            'الإجابة التاسعة عشر',
            'السؤال العشرون',
            'الإجابة العشرون',
            'السؤال الحادى و العشرون',
            'الإجابة الحاديه و العشرون',
            'السؤال الثانى و العشرون',
            'الإجابة الثانية و العشرون',
            'السؤال الثالث و العشرون',
            'الإجابة الثالثة و العشرون',
            'السؤال الرابع و العشرون',
            'الإجابة الرابعة و العشرون',
            'السؤال الخامس و العشرون',
            'الإجابة الخامسة و العشرون',
            'السؤال السادس و العشرون',
            'الإجابة السادسة و العشرون',
            'السؤال السابع و العشرون',
            'الإجابة السابعة و العشرون',


        ];
    }
}
